{"blogs":
	[
		{
		"heading": "Week 1",
		"date": "7/31/2017",
		"blogPost": "This was one hell of a week. I started feeling pretty good about my knowledge of Javascript, and ended feeling like I didn't have the slightest clue in the world. I am getting to a point that I understand exactly why you would do something as soon as someone shows me how they did something, but I am still having trouble just starting the process. I am hoping that doing the planning sessions will help me know where to start and execute better code in the long run."
		},
		{
		"heading": "JavaScript Crushes My Soul",
		"date": "7/31/2017",
		"blogPost": "This week on Game of Thrones, I learned that JavaScript makes me challenge my entire existance as a human and every time I feel like I am conquering a milestone the next thing that comes out of an instructors mouth just puts me right back at square one. Luckily there are 5 more months left of front end for me to feel like I have no idea what I am doing!"
		},
		{
		"heading": "Group Projects",
		"date": "8/5/2017",
		"blogPost": "We had our first group project this week and man it was an experience! It really helped solidify the concept of relying on the people around you to accomplish tasks. We did a great job of lining out how to tackle the project and divy up the tickets to accomplish things. It also helped a lot that we were able to tackle merge conflicts together for the first time. Overall things are feeling pretty good right now!"
		},
		{
		"heading": "Event Listeners",
		"date": "8/15/2017",
		"blogPost": "Event Listeners. Now THIS makes sense to me. It feels so good to finally be in a place where I am not googling everything that I need to do to be able to finish a project and can start from square one and get to the end of an assignment on my own for the most part."
		},
		{
		"heading": "Markdown",
		"date": "8/22/2017",
		"blogPost": "Pretty easy week in terms of new material. Learned about markdown and making a proper readme for your Github repos and then expanded our work on event listeners with the famous WYSIWYG exercise. It was pretty intense, but I was happy that I was able to get through it!"
		},
		{
		"heading": "XHR",
		"date": "8/29/2017",
		"blogPost": "Onto more new concepts! This week it was HXR, which seems easy enough...until you have to worry about the delay in loading of multiple files...and there I went belly flopping into the valley of dispair. But, it was inevitably a really good thing because it forced me to really have to dig deep into documentation and really look at finding a sustainable and usable solution for the code that I am writing."
		},
		{
		"heading": "Bootstrap",
		"date": "8/31/2017",
		"blogPost": "Oh thank God we started bootstrap finally! Styling and having an eye for styling are definitely some weak points for me, so have bootstrap at my disposal is a crutch that I really enjoy having access to, and has been a phenomenal break for my brain after the last couple of weeks of some pretty new concepts. I did see on the calendar that we start IIFE next week so the victory of something easy will be short lived. I'll still take it though."
		},
		{
		"heading": "Task Runners and Browserify",
		"date": "9/18/2017",
		"blogPost": "Task runners and browserify are AWESOME. Finally, something that truly makes JavaScript modular and logical to me. It took a second to get over the thinking with how XHR calls and loading factor into that, but now that I am over that hurdle I am all about this browserify business. It also just makes everything look so clean and streamlined in your project and way easier to track certain code down etc."
		},
		{
		"heading": "Chatty App Group Project and Jquery",
		"date": "10/6/2017",
		"blogPost": "The chatty app was definitely a unique experience. Everyone in my group was incredibly sharp, so we really pushed each other, and being able to use jquery really allowed us to get things spun up quickly. BUT that definitely caused a problem where we just kept pushing and paushing each other to try and stretch the app as far as we could, which ended up in a bad idea to commit something not fully tested to master 2 minutes before we demoed, which resulted in a completely broken app. I learned really quickly that I will NEVER make that mistake again! "
		},
		{
		"heading": "Promises",
		"date": "10/15/2017",
		"blogPost": "Not much to say here, other than that this would have been REALLY nice to have about a month ago!"
		},
		{
		"heading": "APIs",
		"date": "10/24/2017",
		"blogPost": "Once we really started bringing in data from APIs I finally started feeling like a real developer. There is so much power with pulling in data for your apps via an API and it is so awesome to see that there is pretty much an API for anything. Really started getting my brain going for capstones"
		},
		{
		"heading": "Firebase",
		"date": "10/31/2017",
		"blogPost": "I already have a love-hate relationship with firebase. It is awesome, but man if you don't get the data structure perfect it is a freaking damn nightmare. This just made me stoked to get to the backend so we can pull data via a SQL database instead of basically a giant object."
		}
	],
	"projects":
	[
		{
		"Name": "WeatherApp",
		"GitHubURL": "https://github.com/harringtonben/localweatherapp",
		"GIFURL": "images/Weatherapp.gif"
		},
		{
		"Name": "Acme Explosives",
		"GitHubURL": "https://github.com/harringtonben/acmeexplosives",
		"GIFURL": "images/Acmeexplosives.gif"
		},
		{
		"Name": "Chatty App",
		"GitHubURL": "https://github.com/nss-evening-cohort-06/chatty-fancy-butterflies",
		"GIFURL": "https://user-images.githubusercontent.com/30006986/30834406-99eebf50-a218-11e7-8b56-9f3e053ef105.gif"
		},
		{
		"Name": "Dem Badges",
		"GitHubURL": "https://github.com/harringtonben/dembadges",
		"GIFURL": "images/dembadges.gif"
		}
	]
}